# Pandas

Pandas has two main components, Series (1d) and DataFrames (nd).


The DataFrame automatically creates a numeric index for each row.

We can specify a custom index, when creating the DataFrame:


**Functions**

Pandas `pd.function()`
- `DataFrame()`
- `read_csv()`
- `to_datetime()`


Dataframes `x.function()`
- `loc[]`
- `iloc[]`
- `head()`
- `tail()`
- `drop()`
- `set_index()`
- `describe()`
- `value_counts()`
- `groupby()`

In [1]:
import pandas as pd

## DataFrame

In [2]:
data = {
   'ages': [14, 18, 24, 42],
   'heights': [165, 180, 176, 184]
} 

df = pd.DataFrame(data)
df

   ages  heights
0    14      165
1    18      180
2    24      176
3    42      184

### DataFrame

In [3]:
df = pd.DataFrame(data, index=['James', 'Bob', 'Amy', 'Dave'])
df

       ages  heights
James    14      165
Bob      18      180
Amy      24      176
Dave     42      184

## Filtering

By rows or by columns

### loc

In [4]:
df.loc[['Bob', 'Amy']]

     ages  heights
Bob    18      180
Amy    24      176

### iloc

In [5]:
df.iloc[1:3]

     ages  heights
Bob    18      180
Amy    24      176

In [6]:
df[['ages', 'heights']]

       ages  heights
James    14      165
Bob      18      180
Amy      24      176
Dave     42      184

## Conditions

In [7]:
# we can save it in a variable
y = (df['ages'] > 18) & (df['heights'] > 180)

# or slicing it directly
df[(df['ages'] > 18) & (df['heights'] > 180)]

df[y]
y

James    False
Bob      False
Amy      False
Dave      True
dtype: bool

## Reading Data

### read_csv

In [8]:
df = pd.read_csv('Datasets/circuits.csv')
# default to 5 rows
df.head(1)

,circuit_reference,circuit_name,circuit_location,circuit_country,circuit_lat,circuit_lng,circuit_alt,circuit_url,raceId,year,race_round,race_name,race_date,race_time,race_url,season_url
0,albert_park,Albert Park Grand Prix Circuit,Melbourne,Australia,-37.8497,144.968,10,http://en.wikipedia.org/wiki/Melbourne_Grand_P...,1,2009,1,Australian Grand Prix,2009-03-29,06:00:00,http://en.wikipedia.org/wiki/2009_Australian_G...,http://en.wikipedia.org/wiki/2009_Formula_One_...

### tail

In [9]:
df.tail(1)

,circuit_reference,circuit_name,circuit_location,circuit_country,circuit_lat,circuit_lng,circuit_alt,circuit_url,raceId,year,race_round,race_name,race_date,race_time,race_url,season_url
1078,miami,Miami International Autodrome,Miami,USA,25.9581,-80.2389,\N,http://en.wikipedia.org/wiki/Miami_Internation...,1078,2022,5,Miami Grand Prix,2022-05-08,19:30:00,http://en.wikipedia.org/wiki/2022_Miami_Grand_...,http://en.wikipedia.org/wiki/2022_Formula_One_...

### info

In [10]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1079 entries, 0 to 1078
Data columns (total 16 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   circuit_reference  1079 non-null   object
 1   circuit_name       1079 non-null   object
 2   circuit_location   1079 non-null   object
 3   circuit_country    1079 non-null   object
 4   circuit_lat        1079 non-null   float64
 5   circuit_lng        1079 non-null   float64
 6   circuit_alt        1079 non-null   object
 7   circuit_url        1079 non-null   object
 8   raceId             1079 non-null   int64
 9   year               1079 non-null   int64
 10  race_round         1079 non-null   int64
 11  race_name          1079 non-null   object
 12  race_date          1079 non-null   object
 13  race_time          1079 non-null   object
 14  race_url           1079 non-null   object
 15  season_url         1079 non-null   object
dtypes: float64(2), int64(3), object(11)
memory usage: 135.0+ KB

### set_index

In [11]:
#df.set_index('race_date', inplace=True)

In [12]:
#df.head(1)

## Working with Data

### drop

In [13]:
# axis = 1 columns  <-> co1umn
# axis = 0 row      <-> r0w
df.drop(['circuit_reference', 'race_round','circuit_lat', 'circuit_lng', 'circuit_alt', 'circuit_url', 'year', 'race_time', 'race_url', 'season_url'], axis=1, inplace=True)

In [14]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1079 entries, 0 to 1078
Data columns (total 6 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   circuit_name      1079 non-null   object
 1   circuit_location  1079 non-null   object
 2   circuit_country   1079 non-null   object
 3   raceId            1079 non-null   int64
 4   race_name         1079 non-null   object
 5   race_date         1079 non-null   object
dtypes: int64(1), object(5)
memory usage: 50.7+ KB

In [15]:
df.head(1)

,circuit_name,circuit_location,circuit_country,raceId,race_name,race_date
0,Albert Park Grand Prix Circuit,Melbourne,Australia,1,Australian Grand Prix,2009-03-29

In [16]:
# https://pandas.pydata.org/docs/reference/api/pandas.Series.dt.year.html
# https://dataindependent.com/pandas/pandas-to-datetime-string-to-date-pd-to_datetime/

df['month'] = pd.to_datetime(df['race_date'], format='%Y-%m-%d').dt.month_name()

df['day'] = pd.to_datetime(df['race_date'], format='%Y-%m-%d').dt.day_name()

df['year'] = pd.to_datetime(df['race_date'], format='%Y-%m-%d').dt.year

In [19]:
df.head(1)

,circuit_name,circuit_location,circuit_country,raceId,race_name,race_date,month,day,year
0,Albert Park Grand Prix Circuit,Melbourne,Australia,1,Australian Grand Prix,2009-03-29,March,Sunday,2009

### describe

In [20]:
df.describe()

            raceId         year
count  1079.000000  1079.000000
mean    542.020389  1991.389249
std     314.621154    20.009147
min       1.000000  1950.000000
25%     270.500000  1976.000000
50%     540.000000  1993.000000
75%     809.500000  2009.000000
max    1096.000000  2022.000000

In [21]:
df['raceId'].mean()

542.0203892493049

## Grouping

In [22]:
# the parameters are the default values
df['month'].value_counts(sort=True, ascending=False)

July         177
May          152
September    138
August       127
June         126
October      115
April         83
March         77
November      49
January       24
December       8
February       3
Name: month, dtype: int64

In [23]:
df.groupby('month')['raceId'].mean()

month
April        461.927711
August       509.700787
December     937.125000
February     621.666667
January      625.250000
July         548.039548
June         540.468254
March        446.142857
May          534.677632
November     725.959184
October      582.800000
September    536.811594
Name: raceId, dtype: float64

# COVID Data Analysis


You are working with the COVID dataset for California, which includes the number of cases and deaths for each day of 2020.

Find the day when the deaths/cases ratio was largest.

To do this, you need to first calculate the deaths/cases ratio and add it as a column to the DataFrame with the name 'ratio', then find the row that corresponds to the largest value.

- Important: The output should be a DataFrame, containing all of the columns of the dataset for the corresponding row.

In [1]:
import pandas as pd

df = pd.read_csv("Datasets/ca-covid.csv")

df.drop('state', axis=1, inplace=True)
df.set_index('date', inplace=True)

df['ratio'] = df['deaths']/df['cases']

maxi = df['ratio'].max()

print(df[df['ratio'] == maxi])

          cases  deaths     ratio
date
10.03.20      7       1  0.142857